IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	// Register connection parameters event handler
	ble_conn_params_evt_handler_set(on_conn_params_evt);

	// Initialize user services
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		BtAppInitUserServices();
	}

	// Initialize Device Information Service
	if (pCfg->pDevInfo != NULL)
	{
		BtDisInit(pCfg);
	}

	// Initialize user data
	BtAppInitUserData();

	g_BtAppData.AppDevice.bSecure = pCfg->SecType != BTGAP_SECTYPE_NONE;

	// Initialize advertising
	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		if (BtAppAdvInit(pCfg) == false)
		{
			DEBUG_PRINTF("BtAppAdvInit failed\r\n");
			return false;
		}

		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_ADV,
			g_BtAppData.AdvHdl,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}
	else
	{
		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_SCAN_INIT,
			0,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}

	g_BtAppData.State = BTAPP_STATE_INITIALIZED;

	DEBUG_PRINTF("BtAppInit: success\r\n");

	return true;
}

/**
 * @brief Main BLE application run loop.
 *
 * Starts advertising (if peripheral/broadcaster) then enters the
 * main event loop.  SoftDevice events are dispatched through the
 * observer infrastructure triggered by the SD_EVT interrupt.
 */
void BtAppRun()
{
	if (g_BtAppData.State != BTAPP_STATE_INITIALIZED)
	{
		return;
	}

	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		BtAdvStart();
	}

	DEBUG_PRINTF("BtAppRun: entering main loop\r\n");

	while (1)
	{
		AppEvtHandlerExec();
		BtAppEvtWait();
	}
}

// Port-level weak default for BtAppEvtWait. Bare-metal apps use __WFE.
// RTOS apps override with sem take in their bridge code.
__attribute__((weak)) void BtAppEvtWait(void)
{
	__WFE();
}

static void soc_evt_poll(void *context)
{
	uint32_t nrf_err;
	uint32_t evt_id;

	// Wake any RTOS waiter; weak BtAppEvtNotify is empty so bare-metal apps
	// see no effect. SoC events themselves are processed in this dispatch
	// context regardless.
	BtAppEvtNotify();

	DEBUG_PRINTF("soc_evt_poll\r\n");
	while (true) {
		nrf_err = sd_evt_get(&evt_id);
		if (nrf_err) {
			break;
		}

		/* Forward the event to SoC observers. */
		TYPE_SECTION_FOREACH(
			struct nrf_sdh_soc_evt_observer, nrf_sdh_soc_evt_observers, obs) {
			obs->handler(evt_id, obs->context);
		}
	}

	__ASSERT(nrf_err == NRF_ERROR_NOT_FOUND,
		 "Failed to receive SoftDevice SoC event, nrf_error %#x", nrf_err);
}

static void ble_evt_poll(void *context)
{
	int err;

	__aligned(4) static uint8_t evt_buffer[NRF_SDH_BLE_EVT_BUF_SIZE];
	ble_evt_t * const ble_evt = (ble_evt_t *)evt_buffer;

	// Wake any RTOS waiter; weak BtAppEvtNotify is empty so bare-metal apps
	// see no effect. BLE events themselves are processed in this dispatch
	// context regardless.
	BtAppEvtNotify();

	DEBUG_PRINTF("ble_evt_poll evt %x\r\n", ble_evt->header.evt_id);

	while (true) {
		uint16_t evt_len = (uint16_t)sizeof(evt_buffer);

		err = sd_ble_evt_get(evt_buffer, &evt_len);
		if (err) {
			break;
		}


		//DEBUG_PRINTF()("%s", nrf_sdh_ble_evt_to_str(ble_evt->header.evt_id));

		ble_evt_dispatch(ble_evt, context);

#if 0
		if (ble_evt->header.evt_id == BLE_GAP_EVT_CONNECTED) {
			idx_assign(ble_evt->evt.gap_evt.conn_handle);
		}

		/* Forward the event to BLE observers. */
		TYPE_SECTION_FOREACH(
			struct nrf_sdh_ble_evt_observer, nrf_sdh_ble_evt_observers, obs) {
			obs->handler(ble_evt, obs->context);
		}

		if (ble_evt->header.evt_id == BLE_GAP_EVT_DISCONNECTED) {
			idx_unassign(ble_evt->evt.gap_evt.conn_handle);
		}
#endif
	}

	/* An SoC event may have triggered this round of polling, and BLE may not be enabled */
//	__ASSERT((err == NRF_ERROR_NOT_FOUND) || (err == BLE_ERROR_NOT_ENABLED),
//		 "Failed to receive SoftDevice BLE event, nrf_error %#x", err);
}

/* Auto-handle seed requests as a SoC event observer */
NRF_SDH_SOC_OBSERVER(rand_seed, SDBleRandSeed, NULL, HIGH);
/* Listen to SoftDevice events */
NRF_SDH_STACK_EVT_OBSERVER(soc_evt_obs, soc_evt_poll, NULL, HIGHEST);
NRF_SDH_STACK_EVT_OBSERVER(ble_evt_obs, ble_evt_poll, NULL, HIGH);
// Register as BLE event observer
//NRF_SDH_BLE_OBSERVER(s_BtAppBleObserver, ble_evt_dispatch, NULL, USER);



// =====================================================================
// Central / Observer role
// ---------------------------------------------------------------------
// BtAppScanInit programs the scan parameters and arms the first scan.
// BtAppScan continues an in-flight scan (after each ADV_REPORT) or
// starts a fresh one if scanning was idle.
// BtAppScanStop halts scanning.
// BtAppConnect issues a GAP connect request using the parameters that
// were set up by the most recent BtAppScanInit call.
// =====================================================================


bool BtAppConnect(BtGapPeerAddr_t * const pPeerAddr, BtGapConnParams_t * const pConnParam)
{
	// SD requires scanning to be stopped before issuing a connect.
	g_BtAppData.bScan = false;

	return BtGapConnect(pPeerAddr, pConnParam);
}

bool BtAppWrite(uint16_t ConnHandle, uint16_t CharHandle, uint8_t *pData, uint16_t DataLen)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID ||
	    CharHandle == BLE_CONN_HANDLE_INVALID ||
	    pData == nullptr || DataLen == 0)
	{
		return false;
	}

	ble_gattc_write_params_t const write_params = {
		.write_op = BLE_GATT_OP_WRITE_CMD,
		.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
		.handle   = CharHandle,
		.offset   = 0,
		.len      = DataLen,
		.p_value  = pData,
	};

	return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}

bool BtAppEnableNotify(uint16_t ConnHandle, uint16_t CccdHandle)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID ||
	    CccdHandle == BLE_CONN_HANDLE_INVALID)
	{
		return false;
	}

	// CCCD = 16-bit little endian, bit 0 = notify, bit 1 = indicate.
	// CCCD value length is fixed at 2 bytes by the Bluetooth GATT spec.
	uint8_t buf[2] = { BLE_GATT_HVX_NOTIFICATION, 0 };

	ble_gattc_write_params_t const write_params = {
		.write_op = BLE_GATT_OP_WRITE_REQ,    // CCCD writes are write-with-response per spec
		.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
		.handle   = CccdHandle,
		.offset   = 0,
		.len      = sizeof(buf),
		.p_value  = buf,
	};

	return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}


